{
  "backend/main.mo": "Motoko canister managing a leaderboard with score submission, top‑5 queries, and reward claiming including rank lookup.",
  "feature_evidence.json": "Feature evidence report mapping requested game features to affected frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose and behavior of various frontend React components, hooks, and utilities.",
  "frontend/index.css": "Tailwind-based global styles defining theme variables, light/dark mode palettes, and base styling rules.",
  "frontend/index.html": "HTML entry point loading the React app and the canvas‑confetti script.",
  "frontend/src/App.tsx": "Main application component handling game flow, puzzles, scoring, reward generation, notifications, and screen transitions.",
  "frontend/src/components/CreatorCredit.tsx": "Simple component optionally displaying the creator credit text.",
  "frontend/src/components/Dashboard.tsx": "Dashboard showing progress, score, level selection, leaderboard access, and an optional reward card.",
  "frontend/src/components/DashboardDiamond.tsx": "Reward card component displaying diamonds earned, UID, and optional rank for completed games.",
  "frontend/src/components/DiamondNotification.tsx": "Shows a temporary animated card congratulating a player with diamonds, UID, and optional rank.",
  "frontend/src/components/FailSafeChoices.tsx": "Renders multiple-choice buttons where the first option is correct and provides visual feedback before triggering callbacks.",
  "frontend/src/components/GameShell.tsx": "Provides the main game layout with HUD elements like level info, score, difficulty, and navigation buttons.",
  "frontend/src/components/HintPanel.tsx": "Displays a toggleable hint panel with animated reveal and close controls.",
  "frontend/src/components/LeaderboardPanel.tsx": "Shows a styled leaderboard with loading, empty, and populated states using medal icons.",
  "frontend/src/components/LevelCompletePanel.tsx": "Presents a level completion screen showing earned points, total score, and navigation actions.",
  "frontend/src/components/MuteToggle.tsx": "Toggle button for muting or unmuting game sound using useSound hook.",
  "frontend/src/components/puzzles/DragToTargetPuzzle.tsx": "Implements a drag-and-drop puzzle where an emoji must be moved onto a target, giving feedback and calling success or failure callbacks.",
  "frontend/src/components/puzzles/MultiStepSequencePuzzle.tsx": "Implements multi-step click puzzles for specific levels, handling step logic, feedback, and UI for sequences like bulb-then-switch or plug-then-power.",
  "frontend/src/components/puzzles/PuzzleStage.tsx": "Provides a styled container component with background and layout for rendering puzzle content.",
  "frontend/src/components/puzzles/TapTrickPuzzle.tsx": "Handles tap-based puzzles across multiple levels, determining correct tap targets, showing feedback, and rendering level-specific UIs.",
  "frontend/src/components/puzzles/TextRiddlePuzzle.tsx": "Riddle input puzzle that checks typed answers against allowed keywords and displays success or error feedback.",
  "frontend/src/components/QuizCard.tsx": "Empty placeholder component file.",
  "frontend/src/components/QuizQuestion.tsx": "Empty placeholder component file.",
  "frontend/src/components/ScreenTransition.tsx": "Wraps content with fade-in transitions based on a key change.",
  "frontend/src/game/levels.ts": "Defines the list of puzzle levels, including metadata like type, instructions, difficulty, hints, and scoring.",
  "frontend/src/game/useGameSession.ts": "Manages game state including current level, scoring, attempts, navigation, and session resets.",
  "frontend/src/hooks/useActor.ts": "Creates and updates a backend actor tied to user identity, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useAudioUnlock.ts": "Detects first user interaction to enable audio playback on browsers that block autoplay.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for managing Internet Identity auth, including login, logout, and identity state handling.",
  "frontend/src/hooks/useLeaderboard.ts": "Empty file placeholder for leaderboard hook logic.",
  "frontend/src/hooks/useQueries.ts": "Implements React Query hooks for fetching leaderboard data and submitting scores via an actor.",
  "frontend/src/hooks/useQuiz.ts": "Empty file placeholder for quiz logic hook.",
  "frontend/src/hooks/useSound.ts": "Manages sound playback with mute state, audio unlocking, preloading, and queued retries for blocked audio.",
  "frontend/src/hooks/useSubmitScore.ts": "Empty placeholder for a score submission hook.",
  "frontend/src/index.css": "Tailwind base styles, color variables, animations, and UI effects for the application's theme and components.",
  "frontend/src/lib/celebration.ts": "Provides functions to trigger confetti animations for general and level-complete celebrations.",
  "frontend/src/lib/quizData.ts": "Empty placeholder for quiz data definitions.",
  "frontend/src/lib/rewards.ts": "Contains utilities for generating UIDs, formatting diamond counts, and computing leaderboard rank.",
  "frontend/src/main.tsx": "Initializes React app with QueryClient and InternetIdentityProvider, then renders the root component.",
  "frontend/tailwind.config.js": "Tailwind configuration extending themes, colors, animations, and plugin usage.",
  "project_state.json": "Stores project metadata, goals, architectural notes, and existing features for the puzzle game transformation."
}